<a href="https://colab.research.google.com/github/jimsjoo/DL/blob/master/99_1_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 판다스?

테이터프레임(엑셀과 비슷) 과 시리즈라는 자료형  
데이터 분석을 위한 다양한 기능을 제공하는 라이브러리  
R의 데이터프레임에 영향  
내부적으로 numpy 를 사용하므로 함께 import  

http://pandas.pydata.org

기능요약  
https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

# Series

In [0]:
import pandas as pd
import numpy as np

In [0]:
x = [1, 2, 3, 4, 5]
pd.Series(x)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [0]:
x = np.array([1, 2, 3, 4, 5])
pd.Series(x)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [0]:
x = [1, 2, 3, 4, 5]
x = pd.Series(x)

print(x[0])
print(x[1: 3])
print(x[::-1])
print(x[x > 3])
print(x + 1)
print(x * 10)
print(x + x)

1
1    2
2    3
dtype: int64
4    5
3    4
2    3
1    2
0    1
dtype: int64
3    4
4    5
dtype: int64
0    2
1    3
2    4
3    5
4    6
dtype: int64
0    10
1    20
2    30
3    40
4    50
dtype: int64
0     2
1     4
2     6
3     8
4    10
dtype: int64

# Series Index

In [0]:
import pandas as pd
import numpy as np

x = [1, 2, 3, 4, 5]
x = pd.Series(x)
print(x.index)
print(x.values)

RangeIndex(start=0, stop=5, step=1)
[1 2 3 4 5]

In [0]:
x = [1, 2, 3, 4, 5]
x = pd.Series(x, index=['a','b','c','d','e']) #인덱스설정
print(x)

print(x['a']) #명시적 인덱스접근
print(x[0]) #묵시적 인덱스접근
print(x[['a','e']]) #팬시색인, 한번에 여러값 접근
print(x.a)

a    1
b    2
c    3
d    4
e    5
dtype: int64
1
1
a    1
e    5
dtype: int64
1

In [0]:
x = [1, 2, 3, 4, 5]
x = pd.Series(x, index=[1, 2, 3, 4, 5])

# x[0] 오류
print(x.iloc[0]) #묵시적 인덱스로만
print(x.loc[1]) #명시적 인덱스로만

1
1

## 딕셔너리 to Series

In [0]:
x = {"수학":90, "영어":80, "과학":95, "미술":80}
x = pd.Series(x)
x

수학    90
영어    80
과학    95
미술    80
dtype: int64

In [0]:
print(x['수학'])

90

In [0]:
print(x['영어':])

영어    80
과학    95
미술    80
dtype: int64

In [0]:
x = {"수학":90, "영어":80, "과학":95, "미술":80}
x = pd.Series(x, index=["수학", "영어", "과학"])
x

수학    90
영어    80
과학    95
dtype: int64

## Multi Index

In [0]:
student_1 = {"수학":90, "영어":80, "과학":95, "미술":80}
student_2 = {"수학":70, "영어":90, "과학":100, "미술":70}

#index_1 = ['홍길동','홍길동','홍길동','홍길동','이몽룡','이몽룡','이몽룡','이몽룡']
index_1 = ['홍길동' for i in range(len(student_1))] + ['이몽룡' for i in range(len(student_2))]

#index_2 = ['수학','영어','과학','미술','수학','영어','과학','미술']
index_2 = [i for i in student_1] + [i for i in student_2]

value_all = list(student_1.values()) + list(student_2.values())

students = pd.Series(value_all, index=[index_1, index_2])
students

홍길동  수학     90
     영어     80
     과학     95
     미술     80
이몽룡  수학     70
     영어     90
     과학    100
     미술     70
dtype: int64

In [0]:
students['홍길동']

수학    90
영어    80
과학    95
미술    80
dtype: int64

In [0]:
students['이몽룡']

수학     70
영어     90
과학    100
미술     70
dtype: int64

## 결측값 처리방법 (NaN. None)

In [0]:
x = [1, None, 2, None, 3, 4, None]
x = pd.Series(x)
print(x)

print(x.sum())
print(x.max())
print(x.min())

#결측값 개수
print(x.isnull().sum())
print(x.notnull().sum())

#결측값 제거
print(x.dropna())

#결측값을 다른값으로 채우기
x.fillna(0)

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
5    4.0
6    NaN
dtype: float64
10.0
4.0
1.0
3
4
0    1.0
2    2.0
4    3.0
5    4.0
dtype: float64

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
5    4.0
6    0.0
dtype: float64

## concat

In [0]:
x = pd.Series([1, 2, 3])
y = pd.Series([4, 5, 6])
z = pd.Series([7, 8, 9])

pd.concat([x, y, z])

0    1
1    2
2    3
0    4
1    5
2    6
0    7
1    8
2    9
dtype: int64

In [0]:
pd.concat([x, y, z], verify_integrity=True) #같은 값의 인덱스가 있을경우 오류

ValueError: Indexes have overlapping values: Int64Index([0, 1, 2], dtype='int64')

In [0]:
pd.concat([x, y, z], verify_integrity=False, ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [0]:
pd.concat([x, y, z], verify_integrity=False, ignore_index=True, axis=1)

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [0]:
x = pd.Series([1, 2, 3, 4])
y = pd.Series([4, 5, 6])
z = pd.Series([7, 8, 9])

In [0]:
pd.concat([x, y, z], verify_integrity=False, ignore_index=True, axis=1, join='inner')

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [0]:
pd.concat([x, y, z], verify_integrity=False, ignore_index=True, axis=1, join='outer')

   0    1    2
0  1  4.0  7.0
1  2  5.0  8.0
2  3  6.0  9.0
3  4  NaN  NaN

## 연산과 집계함수

In [0]:
x = pd.Series([1, 2, 3, 4, 5])
y = pd.Series([6, 7, 8, 9, 0])

#더하기
print(x.add(10))
print(x.add(y))

#빼기
print(x.sub(y))

#곱하기
print(x.mul(y))

#나누기
print(x.floordiv(2))
print(x.div(2))
print(x.mod(2))

#제곱
print(x.pow(2))

#기초통계
print(x.count())
print(x.min())
print(x.max())
print(x.mean())
print(x.median()) #중간값
print(x.sum())
print(x.std()) # 표준편차
print(x.var()) # 분산
print(x.mad()) # 절대표준편차
print(x.describe()) #기초통계모두

print(x.head(2)) #앞의 일부데이터 확인
print(x.tail(2)) #뒤의 일부데이터 확인

0    11
1    12
2    13
3    14
4    15
dtype: int64
0     7
1     9
2    11
3    13
4     5
dtype: int64
0   -5
1   -5
2   -5
3   -5
4    5
dtype: int64
0     6
1    14
2    24
3    36
4     0
dtype: int64
0    0
1    1
2    1
3    2
4    2
dtype: int64
0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
dtype: float64
0    1
1    0
2    1
3    0
4    1
dtype: int64
0     1
1     4
2     9
3    16
4    25
dtype: int64
5
1
5
3.0
3.0
15
1.5811388300841898
2.5
1.2
count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64
0    1
1    2
dtype: int64
3    4
4    5
dtype: int64

## 실습1

In [0]:
x = [np.nan, 1, 2, 3, 4, 5]
y = pd.Series([x[np.random.randint(0, 6)] for i in range(20)])

print(y)
print("결측값개수", y.isnull().sum())
print(y.dropna())
y.fillna(y.mean())

0     2.0
1     NaN
2     NaN
3     1.0
4     5.0
5     3.0
6     NaN
7     2.0
8     2.0
9     1.0
10    3.0
11    NaN
12    4.0
13    5.0
14    NaN
15    1.0
16    5.0
17    1.0
18    4.0
19    NaN
dtype: float64
결측값개수 6
0     2.0
3     1.0
4     5.0
5     3.0
7     2.0
8     2.0
9     1.0
10    3.0
12    4.0
13    5.0
15    1.0
16    5.0
17    1.0
18    4.0
dtype: float64

0     2.000000
1     2.785714
2     2.785714
3     1.000000
4     5.000000
5     3.000000
6     2.785714
7     2.000000
8     2.000000
9     1.000000
10    3.000000
11    2.785714
12    4.000000
13    5.000000
14    2.785714
15    1.000000
16    5.000000
17    1.000000
18    4.000000
19    2.785714
dtype: float64

# DataFrame

In [0]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [0]:
sales_data['판매량']

0    103
1     70
2    130
3    160
4    190
5    230
Name: 판매량, dtype: int64

In [0]:
sales_data.iloc[1]

연도       2016
판매량        70
매출     300000
순이익    190000
Name: 1, dtype: int64

In [0]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

pd.DataFrame(sales_data, columns=['판매량','매출','순이익'], index=sales_data['연도'])

      판매량      매출     순이익
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018  160  550000  480000
2019  190  700000  600000
2020  230  680000  590000

## 파일생성

In [0]:
%%writefile sales_data.csv
연도,판매량,매출,순이익
2015,103,500000,370000
2016,70,300000,190000
2017,130,400000,300000
2018,60,550000,480000
2019,190,700000,600000
2020,230,680000,590000

Overwriting sales_data.csv

## CSV 파일읽기

In [0]:
sales_data = pd.read_csv('sales_data.csv', index_col='연도', header=0, sep=',')
sales_data

      판매량      매출     순이익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018   60  550000  480000
2019  190  700000  600000
2020  230  680000  590000

## CSV 파일쓰기

In [0]:
sales_data.to_csv('sales_data_save.csv', encoding='utf-8-sig')

## 데이터 추가

In [0]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [0]:
sales_data['순이익율'] = (sales_data['순이익']/sales_data['매출']) * 100
sales_data

     연도  판매량      매출     순이익       순이익율
0  2015  103  500000  370000  74.000000
1  2016   70  300000  190000  63.333333
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706

In [0]:
def check(n):
    if n > 80:
        return '높음'
    else:
        return '낮음'

sales_data['순이익율_비교'] = sales_data['순이익율'].apply(check)
#sales_data['순이익율_비교'] = sales_data['순이익율'].apply(lambda n: '높음' if n > 80 else '낮음')
sales_data

     연도  판매량      매출     순이익       순이익율 순이익율_비교
0  2015  103  500000  370000  74.000000      낮음
1  2016   70  300000  190000  63.333333      낮음
2  2017  130  400000  300000  75.000000      낮음
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음

## 데이터 추가 2

In [0]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [0]:
sales_data[sales_data['매출'] > 300000]

     연도  판매량      매출     순이익
0  2015  103  500000  370000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [0]:
sales_data['테스트1'] = np.where(sales_data['판매량'] > 200, 0, sales_data['판매량'])
sales_data

     연도  판매량      매출     순이익  테스트1
0  2015  103  500000  370000   103
1  2016   70  300000  190000    70
2  2017  130  400000  300000   130
3  2018  160  550000  480000   160
4  2019  190  700000  600000   190
5  2020  230  680000  590000     0

In [0]:
sales_data['테스트2'] = sales_data[sales_data['판매량'] < 100]['판매량'] + 50
sales_data

     연도  판매량      매출     순이익  테스트1   테스트2
0  2015  103  500000  370000   103    NaN
1  2016   70  300000  190000    70  120.0
2  2017  130  400000  300000   130    NaN
3  2018  160  550000  480000   160    NaN
4  2019  190  700000  600000   190    NaN
5  2020  230  680000  590000     0    NaN

In [0]:
sales_data.loc[6] = [2021, 720000,650000, 360, 0, 0]
sales_data

     연도     판매량      매출     순이익  테스트1   테스트2
0  2015     103  500000  370000   103    NaN
1  2016      70  300000  190000    70  120.0
2  2017     130  400000  300000   130    NaN
3  2018     160  550000  480000   160    NaN
4  2019     190  700000  600000   190    NaN
5  2020     230  680000  590000     0    NaN
6  2021  720000  650000     360     0    0.0

In [0]:
sales_data.loc[7] = sales_data.loc[5] + 100
sales_data

       연도       판매량        매출       순이익   테스트1   테스트2
0  2015.0     103.0  500000.0  370000.0  103.0    NaN
1  2016.0      70.0  300000.0  190000.0   70.0  120.0
2  2017.0     130.0  400000.0  300000.0  130.0    NaN
3  2018.0     160.0  550000.0  480000.0  160.0    NaN
4  2019.0     190.0  700000.0  600000.0  190.0    NaN
5  2020.0     230.0  680000.0  590000.0    0.0    NaN
6  2021.0  720000.0  650000.0     360.0    0.0    0.0
7  2120.0     330.0  680100.0  590100.0  100.0    NaN

## 데이터 삭제

In [0]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data['테스트1'] = 'test1'
sales_data['테스트2'] = 'test2'
sales_data['테스트3'] = 'test3'

sales_data

     연도  판매량      매출     순이익   테스트1   테스트2   테스트3
0  2015  103  500000  370000  test1  test2  test3
1  2016   70  300000  190000  test1  test2  test3
2  2017  130  400000  300000  test1  test2  test3
3  2018  160  550000  480000  test1  test2  test3
4  2019  190  700000  600000  test1  test2  test3
5  2020  230  680000  590000  test1  test2  test3

In [0]:
del sales_data['테스트1']
sales_data

     연도  판매량      매출     순이익   테스트2   테스트3
0  2015  103  500000  370000  test2  test3
1  2016   70  300000  190000  test2  test3
2  2017  130  400000  300000  test2  test3
3  2018  160  550000  480000  test2  test3
4  2019  190  700000  600000  test2  test3
5  2020  230  680000  590000  test2  test3

In [0]:
sales_data.drop(['테스트2'], axis='columns', inplace=True)
sales_data

     연도  판매량      매출     순이익   테스트3
0  2015  103  500000  370000  test3
1  2016   70  300000  190000  test3
2  2017  130  400000  300000  test3
3  2018  160  550000  480000  test3
4  2019  190  700000  600000  test3
5  2020  230  680000  590000  test3

In [0]:
sales_data.drop(['테스트3'], axis='columns', inplace=True)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [0]:
sales_data.drop(sales_data.columns[[0, 2]], axis='columns', inplace=True)
sales_data

   판매량     순이익
0  103  370000
1   70  190000
2  130  300000
3  160  480000
4  190  600000
5  230  590000

In [0]:
sales_data.drop(0, inplace=True)
sales_data

   판매량     순이익
1   70  190000
2  130  300000
3  160  480000
4  190  600000
5  230  590000

In [0]:
sales_data.drop([3, 4, 5], inplace=True)
sales_data

   판매량     순이익
1   70  190000
2  130  300000

## Dataframe MultiIndex

In [0]:
df = pd.DataFrame(np.random.randint(1, 100, size=(4, 4)), index=[['A','A','B','B'],['a','b','a','b']], columns=[['가가','가가','나나','나나'],['가','나','가','나']])
df

     가가      나나
      가   나   가   나
A a  61  10  76  67
  b  70  10  49  63
B a  69  11   5  39
  b  11  79  54  67

In [0]:
df['가가']

      가   나
A a  61  10
  b  70  10
B a  69  11
  b  11  79

In [0]:
df.loc['A']

   가가      나나
    가   나   가   나
a  61  10  76  67
b  70  10  49  63

In [0]:
df.index

MultiIndex(levels=[['A', 'B'], ['a', 'b']],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [0]:
df.columns

MultiIndex(levels=[['가가', '나나'], ['가', '나']],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

## GroupBy

In [0]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)), index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],['사과','배','바나나','사과','사과','배','바나나','배']], columns=['판매','재고'])
df.index.names = ['창고명','상품명']
df

         판매  재고
창고명 상품명
A창고 사과   76  28
    배    73  74
    바나나  72  54
    사과   85  74
B창고 사과   64  14
    배    27  46
    바나나  69  60
    배    52  21

In [0]:
df.groupby('창고명').sum()

      판매   재고
창고명
A창고  306  230
B창고  212  141

In [0]:
df.groupby('창고명').max()

     판매  재고
창고명
A창고  85  74
B창고  69  60

In [0]:
df.groupby('창고명').min()

     판매  재고
창고명
A창고  72  28
B창고  27  14

In [0]:
df.groupby('상품명').sum()

      판매   재고
상품명
바나나  141  114
배    152  141
사과   225  116

In [0]:
df.groupby(['창고명','상품명']).sum()

          판매   재고
창고명 상품명
A창고 바나나   72   54
    배     73   74
    사과   161  102
B창고 바나나   69   60
    배     79   67
    사과    64   14

## sort_values

In [0]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)), index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],['사과','배','바나나','사과','사과','배','바나나','배']], columns=['판매','재고'])
df

         판매  재고
A창고 사과    5  87
    배    52  33
    바나나  15  83
    사과   26  24
B창고 사과   70  33
    배    81  62
    바나나  46  36
    배    81  36

In [0]:
df.sort_values(by="판매", ascending=True)

         판매  재고
A창고 사과    5  87
    바나나  15  83
    사과   26  24
B창고 바나나  46  36
A창고 배    52  33
B창고 사과   70  33
    배    81  62
    배    81  36

In [0]:
df.sort_values(by=["판매", "재고"], ascending=[True, False])

         판매  재고
A창고 사과    5  87
    바나나  15  83
    사과   26  24
B창고 바나나  46  36
A창고 배    52  33
B창고 사과   70  33
    배    81  62
    배    81  36

## 실습2

In [3]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randint(1, 100, size=(15, 3)),
        index = [['1학년' for i in range(5)] + ['2학년' for i in range(5)] 
                 + ['3학년' for i in range(5)],
                [str(i)+'반' for i in range(1, 6)] 
                 + [str(i)+'반' for i in range(1, 6)] 
                 + [str(i)+'반' for i in range(1, 6)]],
                columns = ['국어', '영어', '과학'])
df

        국어  영어  과학
1학년 1반  82  66  27
    2반  14  36   5
    3반  89  99  72
    4반  98  46  91
    5반  39   9  31
2학년 1반  51  60  96
    2반  14  97  29
    3반  75  37  79
    4반  27  20  86
    5반  88  35  79
3학년 1반  95  83  39
    2반  87  10  58
    3반  93  40  55
    4반  33  35  38
    5반  62  87  15

In [4]:
df['총점'] = df['국어'] + df['영어'] + df['과학']
df

        국어  영어  과학   총점
1학년 1반  82  66  27  175
    2반  14  36   5   55
    3반  89  99  72  260
    4반  98  46  91  235
    5반  39   9  31   79
2학년 1반  51  60  96  207
    2반  14  97  29  140
    3반  75  37  79  191
    4반  27  20  86  133
    5반  88  35  79  202
3학년 1반  95  83  39  217
    2반  87  10  58  155
    3반  93  40  55  188
    4반  33  35  38  106
    5반  62  87  15  164

In [5]:
df['평균'] = (df['국어'] + df['영어'] + df['과학']) / 3
df

        국어  영어  과학   총점         평균
1학년 1반  82  66  27  175  58.333333
    2반  14  36   5   55  18.333333
    3반  89  99  72  260  86.666667
    4반  98  46  91  235  78.333333
    5반  39   9  31   79  26.333333
2학년 1반  51  60  96  207  69.000000
    2반  14  97  29  140  46.666667
    3반  75  37  79  191  63.666667
    4반  27  20  86  133  44.333333
    5반  88  35  79  202  67.333333
3학년 1반  95  83  39  217  72.333333
    2반  87  10  58  155  51.666667
    3반  93  40  55  188  62.666667
    4반  33  35  38  106  35.333333
    5반  62  87  15  164  54.666667

In [6]:
df.index.names = ['학년','반']
df

        국어  영어  과학   총점         평균
학년  반
1학년 1반  82  66  27  175  58.333333
    2반  14  36   5   55  18.333333
    3반  89  99  72  260  86.666667
    4반  98  46  91  235  78.333333
    5반  39   9  31   79  26.333333
2학년 1반  51  60  96  207  69.000000
    2반  14  97  29  140  46.666667
    3반  75  37  79  191  63.666667
    4반  27  20  86  133  44.333333
    5반  88  35  79  202  67.333333
3학년 1반  95  83  39  217  72.333333
    2반  87  10  58  155  51.666667
    3반  93  40  55  188  62.666667
    4반  33  35  38  106  35.333333
    5반  62  87  15  164  54.666667

In [7]:
df.groupby('학년').sum()

      국어   영어   과학   총점          평균
학년
1학년  322  256  226  804  268.000000
2학년  255  249  369  873  291.000000
3학년  370  255  205  830  276.666667

## 실습3

In [0]:
titanic_df = pd.read_csv('https://raw.githubusercontent.com/jimsjoo/DL/master/dataset/titanic_train.csv')

In [9]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [12]:
print(titanic_df.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
titanic_df['Age'].fillna(titanic_df['Age'].mean(),inplace=True)
print(titanic_df.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [15]:
titanic_df['Cabin'].fillna('N',inplace=True)
print(titanic_df.isnull().sum())

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

In [16]:
titanic_df['Embarked'].fillna('N',inplace=True)
print(titanic_df.isnull().sum())

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [17]:
titanic_df.groupby('Sex')['Survived'].sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

In [0]:
titanic_df.groupby('Pclass')['Survived'].sum()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [0]:
def changeAge(n):
    if n // 10 == 0:
        return '유아'
    elif n // 10 == 1:
        return '10대'
    elif n // 10 == 2:
        return '20대'
    elif n // 10 == 3:
        return '30대'
    elif n // 10 == 4:
        return '40대'
    elif n // 10 == 5:
        return '50대'
    elif n // 10 == 6:
        return '60대'
    else:
        return '노인'

In [0]:
titanic_df['Age_Range'] = titanic_df['Age'].apply(changeAge)

In [0]:
titanic_df.groupby('Age_Range')['Survived'].sum()

Age_Range
10대     41
20대    129
30대     73
40대     34
50대     20
60대      6
노인       1
유아      38
Name: Survived, dtype: int64